Repository: mebitek/selfhosting
Catalog: libretranslate/libretranslate/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Invalid JSON format
ru: Недействительный формат JSON

source: Auto Detect
ru: автоопределённого языка

source: Unauthorized
ru: Несанкционированно

source: Too many request limits violations
ru: Слишком много ограничений по запросу

source: Invalid API key
ru: Недействительный ключ API

source: Please contact the server operator to get an API key
ru: Пожалуйста, свяжитесь с оператором сервера, чтобы получить ключ API

source: Visit %(url)s to get an API key
ru: Посетите %(url)s для получения ключа API

source: Slowdown:
ru: Притормозите:

source: Invalid request: missing %(name)s parameter
ru: Недействительный запрос: отсутствует параметр «%(name)s»

source: Invalid request: request (%(size)s) exceeds text limit (%(limit)s)
ru: Недействительный запрос: запрос (%(size)s) превышает ограничение текста (%(limit)s)

source: %(lang)s is not supported
ru: %(lang)s не поддерживается

source: %(format)s format is not supported
ru: Формат %(format)s не поддерживается

source: %(tname)s (%(tcode)s) is not available as a target language from %(sname)s (%(scode)s)
ru: %(tname)s (%(tcode)s) не доступен как целевой язык от %(sname)s (%(scode)s)

source: Cannot translate text: %(text)s
ru: Не удаётся перевести текст: %(text)s

source: Files translation are disabled on this server.
ru: Перевод файлов отключён на этом сервере.

source: Invalid request: empty file
ru: Недействительный запрос: пустой файл

source: Invalid request: file format not supported
ru: Недействительный запрос: формат файла не поддерживается

source: Invalid filename
ru: Неверное имя файла

source: Suggestions are disabled on this server.
ru: Предложения отключены на этом сервере.

source: English
ru: английский

source: Arabic
ru: арабский

source: Azerbaijani
ru: азербайджанский

source: Chinese
ru: китайский

source: Czech
ru: чешский

source: Danish
ru: датский

source: Dutch
ru: голландский

source: Esperanto
ru: эсперанто

source: Finnish
ru: финский

source: French
ru: французский

source: German
ru: немецкий

source: Greek
ru: греческий

source: Hebrew
ru: иврит

source: Hindi
ru: хинди

source: Hungarian
ru: венгерский

source: Indonesian
ru: индонезийский

source: Irish
ru: ирландский

source: Italian
ru: итальянский

source: Japanese
ru: японский

source: Korean
ru: корейский

source: Persian
ru: персидский

source: Polish
ru: польский

source: Portuguese
ru: португальский

source: Russian
ru: русский

source: Slovak
ru: словацкий

source: Spanish
ru: испанский

source: Swedish
ru: шведский

source: Turkish
ru: турецкий

source: Ukranian
ru: украинский

source: Vietnamese
ru: вьетнамский

source: Retrieve list of supported languages
ru: Перевести текст с одного языка на другой

source: List of languages
ru: Список языков

source: translate
ru: перевод

source: Translate text from a language to another
ru: Перевести текст с языка на другой

source: Translated text
ru: Перевод текста

source: Invalid request
ru: При недействительном запросе

source: Translation error
ru: При ошибке перевода

source: Slow down
ru: При замедлении

source: Banned
ru: При блокировке

source: Hello world!
ru: Привет мир!

source: Text(s) to translate
ru: Текст для перевода

source: Source language code
ru: Код исходного языка

source: Target language code
ru: Код целевого языка

source: Format of source text: * `text` - Plain text * `html` - HTML markup
ru: Формат исходного текста: * `text` - Простой текст * `html` - HTML-разметка

source: API key
ru: Ключ API

source: Translate file from a language to another
ru: Перевести файл с языка на другой

source: Translated file
ru: При переведённом файле

source: File to translate
ru: Файл для перевода

source: Detect the language of a single text
ru: Обнаружение языка одного текста

source: Detections
ru: Обнаружения

source: Detection error
ru: При ошибке обнаружения

source: Text to detect
ru: Текст для обнаружения

source: Retrieve frontend specific settings
ru: Получение конкретных настроек интерфейса (frontend)

source: frontend settings
ru: При настройке интерфейса (frontend)

source: Submit a suggestion to improve a translation
ru: Подать предложение для улучшения перевода

source: Success
ru: При отправке

source: Not authorized
ru: Если пользователь не авторизован

source: Original text
ru: Изначальный текст

source: Suggested translation
ru: Предлагаемый перевод

source: Language of original text
ru: Язык изначального текста

source: Language of suggested translation
ru: Язык предлагаемого перевода

source: feedback
ru: обратная связь

source: Language code
ru: Языковой код

source: Human-readable language name (in English)
ru: Человеческое название языка (на английском языке)

source: Supported target language codes
ru: Поддерживаемые языковые коды

source: Translated text(s)
ru: Перевод текста

source: Error message
ru: Сообщение ошибки

source: Reason for slow down
ru: Причина замедления

source: Translated file url
ru: URL переведённого файла

source: Confidence value
ru: Уровень достоверности

source: Character input limit for this language (-1 indicates no limit)
ru: Предел вводимых символов для этого языка (-1 не указывает на предел)

source: Frontend translation timeout
ru: Превышаемое время ожидания перевода интерфейса (frontend)

source: Whether the API key database is enabled.
ru: При включённой базе данных ключей API.

source: Whether an API key is required.
ru: При требовании ключа API.

source: Whether submitting suggestions is enabled.
ru: При включенном предложения перевода.

source: Supported files format
ru: Поддерживаемый формат файлов

source: Whether submission was successful
ru: При отправке предложения

source: Copy text
ru: Копировать текст

source: Cannot load %(url)s
ru: Невозможно загрузить %(url)s

source: Unknown error
ru: Неизвестная ошибка

source: Copied
ru: Скопировано

source: Thanks for your correction. Note the suggestion will not take effect right away.
ru: Спасибо за вашу поправку. Обратите внимание, что предложение не будет действовать сразу.

source: No languages available. Did you install the models correctly?
ru: Нет языков. Вы правильно установили модели?

source: Type in your API Key. If you need an API key, %(instructions)s
ru: Введите ваш ключ API. Если вам нужен ключ API — %(instructions)s

source: press the "Get API Key" link.
ru: нажмите на ссылку «Получить ключ API».

source: contact the server operator.
ru: связаться с оператором сервера.

source: Free and Open Source Machine Translation API
ru: Бесплатный и открытый источник машинного перевода с помощью API

source: Free and Open Source Machine Translation API. Self-hosted, offline capable and easy to setup. Run your own API server in just a few minutes.
ru: Бесплатный и открытый источник машинного перевода с помощью API. Самостоятельный хостинг, возможность работы в автономном режиме и простота настройки. Запустите свой собственный сервер API всего за несколько минут.

source: translation
ru: перевод

source: API Docs
ru: Документация API

source: Get API Key
ru: Получить ключ API

source: Set API Key
ru: Установить ключ API

source: Change language
ru: Изменить язык

source: Edit
ru: Изменить

source: Toggle dark/light mode
ru: Toggle темно-легкий режим

source: Dismiss
ru: Закрыть

source: Translation API
ru: Перевод с помощью API

source: Translate Text
ru: Перевести текст

source: Translate Files
ru: Перевести файлы

source: Translate from
ru: Перевести с

source: Swap source and target languages
ru: Поменять местами исходный и целевой языки

source: Translate into
ru: Перевести на

source: Text to translate
ru: Текст для перевода

source: Delete text
ru: Удалить текст

source: Suggest translation
ru: Предложить перевод

source: Cancel
ru: Отмена

source: Send
ru: Отправить

source: Supported file formats:
ru: Поддерживаемые форматы файлов:

source: File
ru: Файл

source: Remove file
ru: Удалить файл

source: Translate
ru: Перевести

source: Download
ru: Скачать

source: Request
ru: Запрос

source: Response
ru: Ответ

source: Open Source Machine Translation API
ru: API машинного перевода с открытым исходным кодом

source: Self-Hosted. Offline Capable. Easy to Setup.
ru: Самостоятельный хостинг. Возможность работы в автономном режиме. Легко настраивается.

source: License:
ru: Лицензия:

source: This public API should be used for testing, personal or infrequent use. If you're going to run an application in production, please %(host_server)s or %(get_api_key)s.
ru: Этот публичный API должен использоваться для тестирования, личного или нечастого использования. Если вы собираетесь запустить приложение в производстве, пожалуйста %(host_server)s или %(get_api_key)s.

source: host your own server
ru: разместите собственный сервер

source: get an API key
ru: получите ключ API

source: Made with %(heart)s by %(contributors)s and powered by %(engine)s
ru: Сделано с %(heart)s благодаря %(contributors)s и работает на %(engine)s

source: %(libretranslate)s Contributors
ru: участникам, внёсшим вклад в разработку %(libretranslate)s
